Repository: Kyle-krn/fakeuser_api
Catalog: fake_users_api/locale/*/LC_MESSAGES/django.po
Languages: ru

source: Api documentation
ru: Документация

source: Hi, my name is
ru: Привет, меня зовут

source: Name
ru: Имя

source: Birthday
ru: День рождения

source: Address
ru: Адрес

source: Phone
ru: Телефон

source: Password
ru: Пароль

source: Navigation
ru: Навигация

source: How to use
ru: Как использовать?

source: Results
ru: Ответ

source: Requesting Multiple Users
ru: Несколько пользователей

source: Gender
ru: Пол

source: Seeds
ru: Семена

source: Formats
ru: Формат

source: Nationalities
ru: Национальности

source: Including/Excluding fields
ru: Включение/исключение полей

source: You can use AJAX to call the Random User Generator API and will receive a randomly generated user in return.
ru: Вы можете использовать AJAX для вызова API и получите случайно сгенерированного пользователя

source: If you are using jQuery, you can use the $.ajax() function in the code snippet below to get started.
ru: Если вы используете jQuery, вы можете использовать функцию $.ajax() в коде. Используйте код в примере для старта.

source: The application will provide you with a JSON, XML, CSV, or YAML object that you can parse and apply to your application.
ru: Приложение вернет вам JSON, XML, CSV или YAML, который вы сможете спарсить и использовать в своем приложении.

source: You can specify the format you want the results in using the format parameter.
ru: Вы можете указать формат в которм хотите получить результат.

source: Random User Generator allows you to fetch up to 700 generated users in one request using the results parameter.
ru: API позволяет получить до 700 случайно сгенерированных пользователей за один запрос.

source: You can specify whether you would like to have only male or only female users generated by adding the gender parameter to your request.
ru: Вы можете указать пол, что бы пользователи генерировались только мужчинами или только женщинами, добавив параметр пола в свой запрос.

source: Valid values for the gender parameter are "male" or "female", or you may leave the parameter blank.
ru: Валидные значения для параметра пола "male" или "female", или вы можете оставить параметр пустым.

source: Any other value will cause the service to return both male and female users.
ru: Любое другое значение приведет к тому, что сервис вернет пользователей обоих полов.

source: Seeds allow you to always generate the same set of users. For example, the seed "someseed" will always return results for Michael Robinson.
ru: Семена позволяют вам сгенерировать всегда один и тот же набор пользователей. Например семя "someseed" всегда будет возвращать пользователя с именем Michael Robinson.

source: Seeds can be any string or sequence of characters.
ru: Семена могут быть любой строкой или последовательностью символов.

source: We currently offer the following data formats
ru: Вы можете получить результат в следующих форматах

source: Just specify the format you would like returned by using the format parameter.
ru: Просто укажите формат, в котором вы хотите получить ответ.

source: You can request a different nationality of a randomuser.
ru: Вы можете запросить другую национальность пользователя.

source: Pictures won't be affected by this, but data such as location, cell/home phone, id, etc. will be more appropriate
ru: Это не повлияет на изображения, но такие данные, как местоположение, мобильный телефон, имя и т.д будут сгенерированны с учетом национальности.

source: You can specify a nationality like so
ru: Вы можете указать одну национальность

source: Randomuser will return us nats by default. You can have some control with the nats that you'd like to have generated by specifying a comma seperated list
ru: API вернет вам US национальность по умолчанию. Вы можете указать список национальностей из которых вы хотите получить пользователей.

source: Sometimes, maybe you want some random names and not extraneous data such as location, phone, etc. Using the include and exclude parameters, you can specify which fields to include or exclude respectively.
ru: Возможно вам нужны только случайные имена, без других данных. С помощью параметров include и exclude вы можете указать, какие поля включать или исключать из ответа.

source: These parameters accept the following values in a comma delimited list
ru: Эти параметры принимают следующие значения

source: If you only wanted the names,nats,and locations of users
ru: Если вам нужны только имена, национальности и местоположение пользователей

source: If you want everything except for login data
ru: Если вы хотите все поля, кроме login

source: Generate password
ru: Генератор паролей

source: Generate nickname
ru: Генератор никнейма

source: Generate name
ru: Генератор имен

source: Generate UUID
ru: Генератор UUID

source: First name, last name and patronymic generator
ru: Генератор имён

source: Format
ru: Формат

source: Russian
ru: Русский

source: Full name
ru: ФИО

source: First, last name
ru: Имя, фамилия

source: Last, first name
ru: Фамилия, имя

source: Last name and initials
ru: Фамилия и инициалы

source: First name and initials
ru: Имя и инициалы

source: First name
ru: Имя

source: Eng
ru: Английский

source: Sex
ru: Пол

source: Any
ru: Любой

source: Male
ru: Мужской

source: Female
ru: Женский

source: Count
ru: Количество

source: Get
ru: Получить

source: Generates random names, Russian or English, in various formats. For Russian names, the generation of both full names and their various variations, including initials, is supported.
ru: Генератор случайных имен, на русском и англиском языках, в различных форматах.Для русских имен поддерживается генерация как полных имён, так и различных вариаций, включая инициалы.

source: Name and surname generator will help you get random results of both Russian and English names. They are formed on the basis of mixing the input data. The generator of random names and surnames will allow you to quickly come up with an online pseudonym in Latin or Cyrillic.
ru: Генератор поможет вам получить случайные результаты как русских, так и английских имен. Они формируются на основе смешивания входных данных. Генератор случайных имен и фамилий позволит вам быстро придумать онлайн-псевдоним на латинице или кириллице.

source: The received data can be formatted as a list using various separators, including for insertion into spreadsheets and documents.
ru: Полученные данные можно оформить в виде списка с использованием различных разделителей, в том числе для вставки в электронные таблицы и документы.

source: Block
ru: Блок

source: Text
ru: Текст

source: Line break
ru: Перенос строки

source: comma and space
ru: запятая и пробел

source: semicolon and space
ru: точка с запятой и пробел

source: comma
ru: запятая

source: semicolon
ru: точка с запятой

source: Copy
ru: Копировать

source: Generator password
ru: Генератор паролей

source: Generate a secure password
ru: Генератор паролей

source: Use our online password generator to instantly create a secure, random password
ru: Используйте наш онлайн генератор паролей, чтобы создать случайный и надежный пароль

source: Customize your password
ru: Настройте ваш пароль

source: Easy to say
ru: Легко произнести

source: Avoid numbers and special characters
ru: Без цифр и символов

source: Easy to read
ru: Легко прочитать

source: Avoid ambiguous characters like l, 1, 0 and 0
ru: Без похожих символов таких как l, 1 O and 0

source: All characters
ru: Все символы

source: Any characters combinations
ru: Любые комбинации символов

source: Uppercase
ru: Верхний регистр

source: Lowercase
ru: Нижний регистр

source: Numbers
ru: Цифры

source: Symbols
ru: Символы

source: Use our online generator to instantly create random UUID/GUID
ru: Используйте наш онлайн-генератор для создания случайных UUID/GUID

source: Delete
ru: Удалить

source: A Version 1 UUID is a universally unique identifier that is generated using a timestamp and the MAC address of the computer on which it was generated.
ru: UUIDv1 - это универсальный уникальный идентификатор, который генерируется с использованием временной метки и MAC-адреса компьтера, на котором он был создан.

source: A Version 4 UUID is a universally unique identifier that is generated using random numbers. The Version 4 UUIDs produced by this site were generated using a secure random number generator
ru: UUIDv4 - это универсальный уникальный идентификатор, который генерируется с использованием случайных чисел. UUIDv4 созданные этим сайтом, были сгенерированы с использованием безопасного генератора случайных чисел
